---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.Insert(Autodesk.Revit.DB.PaperSize)
source: html/6e0bee7e-321a-2683-80cb-c5824429d5b4.htm
---
# Autodesk.Revit.DB.PaperSizeSet.Insert Method

Insert the specified item into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	PaperSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PaperSize`) - The item to be inserted into the set.

## Returns
Returns whether the item was inserted into the set.